# 鉴于我和小然然每次吃饭都纠结去哪，所以这次就把他写成随机选择，这样愿赌服输
import random
def xuanze():
    print("这个工具是去哪吃的随机小程序\n",
          "1:'汤城小厨',2:'河沿肉饼',3:'大四喜',4:'KFC',5:'麦当劳',\n"
          "6:'西餐',7:'柴氏牛肉面',8:'新和小馆',9:'重八牛府',\n"
          "10:'霸王餐',11:'探新店',12:'黑珍珠',13:'听老婆的！\n"
          )
    a = {1:'汤城小厨',2:'河沿肉饼',3:'大四喜',4:'KFC',5:'麦当劳',
         6:'西餐',7:'柴氏牛肉面',8:'新和小馆',9:'重八牛府',
         10:'霸王餐',11:'探新店',12:'黑珍珠',13:'听老婆的！'}

    for i in a.keys():
        x = random.sample(a.keys(),1)   # 随机从字典中取一个key,第二个参数为限制个数。
        y =x[0]
    print('去吃：'+str(a[y]))
xuanze()
while True:
    e = input('按r重新选择,其它键退出：')
    if e == 'r':
        xuanze()
    else:
        exit()